# FamilyCategoryId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Family..::..FamilyCategoryId Property
Family Class See Also
---
The id of the category or sub category in which the elements that this family could generate reside.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ElementId FamilyCategoryId { get; set; }
```

Visual Basic
---
```text
Public Property FamilyCategoryId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ FamilyCategoryId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The input category id cannot be assigned as the new category for this family. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: The family is not an owner family for its own editable document. |

# See Also
Family Class
Autodesk.Revit.DB Namespace